In [1]:
import pandas as pd

In [3]:
df = pd.read_json("https://data.nasa.gov/resource/y77d-th95.json")

In [5]:
df.head(5)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

In [7]:
df.describe()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,id,mass,reclat,reclong
count,133.000000,134.000000,1000.00000,9.720000e+02,988.000000,988.000000
mean,26.939850,1537.888060,15398.72800,5.019020e+04,29.691592,19.151208
std,12.706929,899.826915,10368.70402,7.539857e+05,23.204399,68.644015
min,1.000000,10.000000,1.00000,1.500000e-01,-44.116670,-157.866670
25%,17.000000,650.250000,7770.50000,6.795000e+02,21.300000,-5.195832
50%,24.000000,1647.000000,12757.50000,2.870000e+03,35.916665,17.325000
75%,37.000000,2234.250000,18831.25000,1.005000e+04,45.817835,76.004167
max,50.000000,3190.000000,57168.00000,2.300000e+07,66.348330,174.400000